"""
Потрібно обчислити, скільки банок фарби потрібно, щоб пофарбувати поверхню бака циліндричної форми.
Пофарбувати треба і зовні, і зсередини. Користувач вводить діаметр і висоту бака, а також, яку площу
можна забарвити однієї банкою фарби.
"""

def task1():
  """
  Функція призначена для обчилення
  Args: викликаються в самій функції
  Return: Повертає рядок з вказівкою на те скільки банок фарби потрібно
  """

   #data entry block

diam = float(input("\nУведіть діаметр(у числовому значенні):   "))
high = float(input("Уведіть висоту(у числовому значенні):    "))
number = float(input("Уведіть площу,яку можна зафарбувати однією банкою(у числовому значенні): ))"))

        #unit of calculations
import math

rez = (((diam * (math.pi)) * (high + (diam / 2))) // number) + 1

   # output block
return(print("\n Необхідна кількість банок:", '%.0f' % rez))