""""Написати програму, яка аналізує дані про вік і відносить людину до однієї з чотирьох груп:
дошкільник, учень, працівник, пенсіонер. Вік вводиться з клавіатури. """

def task2():
""""
Функція,що аналізує людей за віком
Args: викликаються в самій функції
Return: рядок,що складається з одного слова(учень/дошкільник/працівник/пенсіонер)
"""

age = int(input("\nУведіть вік людини(ціле число):   "))

 if (age <= 6):
   return(print("Дошкільник"))

 elif ((age > 6) and (age <= 18)):
    return(print("Учень"))

 else:

    while True:
        people = input("Уведіть стать людини(жінка/чоловік)")
        if people in ("жінка", "чоловік"):
            break
        return(print("Некоректна відповідь.Уведіть жінка або чоловік:"))

    if people == "жінка":

        if (age > 18) and (age <= 55):
            return(print("Працівник"))

        else:
            return(print("Пенсіонер"))

    else:

        if (age > 18) and (age <= 65):
            return(print("Працівник"))
        else:
            return(print("Пенсіонер"))